Documents/ПоступлениеТоваровИУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПоступлениеТоваровИУслуг</Name>
			<Comment>Поступление товаров и услуг</Comment>
			<BasedOn>
				<xr:Item>Document.РеализацияТоваровИУслуг</xr:Item>
				<xr:Item>Document.ЗаказДоговор</xr:Item>
				<xr:Item>Document.ЗаказНаПроизводство</xr:Item>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.Монтаж</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаказыПоставщикам</xr:Item>
				<xr:Item>AccumulationRegister.ОтгрузкиСПроизодстваДляРозницы</xr:Item>
				<xr:Item>AccumulationRegister.Закупки</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыРозницыПоставщикам</xr:Item>
				<xr:Item>AccumulationRegister.ПоступленияДляРозницыОтПроизодства</xr:Item>
				<xr:Item>AccumulationRegister.ОбеспечениеЗаказовРозницы</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыРозницыВПроизводстве</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентамиВВалюте</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресМонтажа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦеныПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦенПоставщиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВхДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВхНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРозничногоДоговора</Name>
					<Comment>#7381</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаДоставку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоступлениеОтПроизводства</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоступлениеОтПроизводстваПоРучнымЗаказам</Name>
					<Comment>#7381</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоступлениеОтПроизводстваУИБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьДоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокРаспределенияСтоимостиДоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданПриИспользованииНастройкиУчетОбеспеченностиРозницыПоКомнатам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданПриИспользованииПодразделений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Потолок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комната</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Потолок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС21</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС22</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПоступлениеТоваровИУслуг/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПечатьДокумета

// Заполняет список команд печати.
// 
// Параметры:
// КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.ПоступлениеТоваровИУслуг";
    КомандаПечати.Идентификатор = "ТоварнаяНакладная";
    КомандаПечати.Представление = НСтр("ru = 'Товарная накладная'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.ПоступлениеТоваровИУслуг";
    КомандаПечати.Идентификатор = "ТОРГ12";
    КомандаПечати.Представление = НСтр("ru = 'ТОРГ-12 (за поставщика)'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
// МассивОбъектов – Массив – ссылки на объекты, которые нужно распечатать;
// ПараметрыПечати – Структура – дополнительные настройки печати;
// КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр)
// ОбъектыПечати – СписокЗначений – значение – ссылка на объект;
// представление – имя области, в которой был выведен объект (выходной параметр);
// ПараметрыВывода – Структура – дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТОРГ12") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТОРГ12", НСтр("ru = 'ТОРГ-12'"), ПечатьТОРГ12(МассивОбъектов, ОбъектыПечати));
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТоварнаяНакладная") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТоварнаяНакладная", НСтр("ru = 'Товарная накладная'"), СформироватьПечатнуюФормуТоварнойНакладной(МассивОбъектов, ОбъектыПечати));
	
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДанныеДляПечатныхФорм(МассивОбъектов) Экспорт
    
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("КолонкаАртикул", Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить());
	Запрос.Текст = 	
    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	ПоступлениеТоваровИУслуг.Ссылка КАК Ссылка,
    |	ПоступлениеТоваровИУслуг.ПометкаУдаления КАК ПометкаУдаления,
    |	ПоступлениеТоваровИУслуг.Номер КАК Номер,
    |	ПоступлениеТоваровИУслуг.Дата КАК Дата,
    |	ПоступлениеТоваровИУслуг.ВхНомер КАК ВхНомер,
    |	ПоступлениеТоваровИУслуг.ВхДата КАК ВхДата,
    |	ПоступлениеТоваровИУслуг.Проведен КАК Проведен,
    |	ПоступлениеТоваровИУслуг.Валюта КАК Валюта,
    |	ПоступлениеТоваровИУслуг.Склад КАК Склад,
    |	ПоступлениеТоваровИУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
    |	ПоступлениеТоваровИУслуг.Комментарий КАК Комментарий,
    |	ПоступлениеТоваровИУслуг.Контрагент КАК Контрагент,
    |	ПоступлениеТоваровИУслуг.Организация КАК Организация,
    |	ПоступлениеТоваровИУслуг.Автор КАК Автор,
    |	ПоступлениеТоваровИУслуг.СуммаДокумента КАК СуммаДокумента,
    |	ПоступлениеТоваровИУслуг.Организация.ОсновнойБанковскийСчет КАК БанковскийСчет,
    |	ПоступлениеТоваровИУслуг.Основание КАК Основание,
    |	0 КАК ИтогоСуммаНДС,
    |	0 КАК ИтогоСуммаБезНДС,
    |	ПоступлениеТоваровИУслуг.Организация.ОсновнойБанковскийСчет.НомерСчета КАК БанковскийСчетНомерСчета,
    |	ПоступлениеТоваровИУслуг.Организация.ОсновнойБанковскийСчет.БИК КАК БанковскийСчетБИК,
    |	ПоступлениеТоваровИУслуг.Организация.ОсновнойБанковскийСчет.КоррСчет КАК БанковскийСчетКоррСчет,
    |	ПоступлениеТоваровИУслуг.Организация.ОсновнойБанковскийСчет.НаименованиеБанка КАК БанковскийСчетНаименованиеБанка,
    |	ПоступлениеТоваровИУслуг.Организация.ИНН КАК ИНН,
    |	ПоступлениеТоваровИУслуг.Организация.КПП КАК КПП,
    |	ПоступлениеТоваровИУслуг.Организация.Руководитель КАК ФИОРуководителя,
    |	ПоступлениеТоваровИУслуг.Организация.ГлавныйБухгалтер КАК ФИОГлавБухгалтера,
    |	ПоступлениеТоваровИУслуг.Организация.ПолноеНаименование КАК ОрганизацияПолноеНаименование,
    |	ВЫБОР
    |		КОГДА НЕ ПоступлениеТоваровИУслуг.Контрагент.НаименованиеПолное = """"
    |			ТОГДА ПоступлениеТоваровИУслуг.Контрагент.НаименованиеПолное
    |		ИНАЧЕ ПоступлениеТоваровИУслуг.Контрагент.Наименование
    |	КОНЕЦ КАК КонтрагентНаименованиеПолное,
    |	ПоступлениеТоваровИУслуг.Контрагент.ИНН КАК КонтрагентИНН,
    |	ПоступлениеТоваровИУслуг.Контрагент.ОсновнойБанковскийСчет.НомерСчета КАК КонтрагентБанковскийСчетНомерСчета,
    |	ПоступлениеТоваровИУслуг.Контрагент.ОсновнойБанковскийСчет.БИК КАК КонтрагентБанковскийСчетБИК,
    |	ПоступлениеТоваровИУслуг.Контрагент.ОсновнойБанковскийСчет.КоррСчет КАК КонтрагентБанковскийСчетКоррСчет,
    |	ПоступлениеТоваровИУслуг.Контрагент.ОсновнойБанковскийСчет.НаименованиеБанка КАК КонтрагентБанковскийСчетНаименованиеБанка,
    |	ПоступлениеТоваровИУслуг.Организация.Руководитель.Должность КАК ДолжностьРуководителя,
    |	ПоступлениеТоваровИУслуг.Автор.Сотрудник.Должность КАК ДолжностьКладовщика,
    |	ПоступлениеТоваровИУслуг.Автор.Сотрудник КАК ФИОКладовщика,
    |	ПоступлениеТоваровИУслуг.АдресМонтажа КАК АдресМонтажа,
    |	ПоступлениеТоваровИУслуг.ВидЦеныПоставщика КАК ВидЦеныПоставщика,
    |	ПоступлениеТоваровИУслуг.Подразделение КАК Подразделение,
    |	ПоступлениеТоваровИУслуг.СтатьяРасходов КАК СтатьяРасходов,
    |	ПоступлениеТоваровИУслуг.СтоимостьДоставки КАК СтоимостьДоставки,
    |	ПоступлениеТоваровИУслуг.ПорядокРаспределенияСтоимостиДоставки КАК ПорядокРаспределенияСтоимостиДоставки
    |ИЗ
    |	Документ.ПоступлениеТоваровИУслуг КАК ПоступлениеТоваровИУслуг
    |ГДЕ
    |	ПоступлениеТоваровИУслуг.Ссылка В(&МассивОбъектов)
    |
    |УПОРЯДОЧИТЬ ПО
    |	Ссылка
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	""Товары"" КАК ИмяТЧ,
    |	ДанныеТабличнойЧасти.Ссылка КАК Ссылка,
    |	ДанныеТабличнойЧасти.НомерСтроки КАК НомерСтроки,
    |	ВЫБОР
    |		КОГДА &КолонкаАртикул
    |			ТОГДА ДанныеТабличнойЧасти.Номенклатура.Артикул
    |		ИНАЧЕ ДанныеТабличнойЧасти.Номенклатура.Код
    |	КОНЕЦ КАК Код,
    |	ДанныеТабличнойЧасти.Номенклатура.Артикул КАК Артикул,
    |	ДанныеТабличнойЧасти.Номенклатура КАК Номенклатура,
    |	ДанныеТабличнойЧасти.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
    |	ДанныеТабличнойЧасти.СерияНоменклатуры КАК СерияНоменклатуры,
    |	ДанныеТабличнойЧасти.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
    |	ДанныеТабличнойЧасти.Коэффициент КАК Коэффициент,
    |	ДанныеТабличнойЧасти.Количество КАК Количество,
    |	ДанныеТабличнойЧасти.Цена КАК Цена,
    |	ДанныеТабличнойЧасти.Сумма КАК Сумма,
    |	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС) КАК СтавкаНДС,
    |	0 КАК СуммаНДС,
    |	ДанныеТабличнойЧасти.Сумма - 0 КАК СуммаБезНДС,
    |	ДанныеТабличнойЧасти.Сумма КАК СуммаСНДС,
    |	ДанныеТабличнойЧасти.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод
    |ПОМЕСТИТЬ ВТ_ДанныеТабличнойЧасти
    |ИЗ
    |	Документ.ПоступлениеТоваровИУслуг.Товары КАК ДанныеТабличнойЧасти
    |ГДЕ
    |	ДанныеТабличнойЧасти.Ссылка В(&МассивОбъектов)
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	""Услуги"",
    |	ДанныеТабличнойЧасти.Ссылка,
    |	ДанныеТабличнойЧасти.НомерСтроки,
    |	ВЫБОР
    |		КОГДА &КолонкаАртикул
    |			ТОГДА ДанныеТабличнойЧасти.Номенклатура.Артикул
    |		ИНАЧЕ ДанныеТабличнойЧасти.Номенклатура.Код
    |	КОНЕЦ,
    |	ДанныеТабличнойЧасти.Номенклатура.Артикул,
    |	ДанныеТабличнойЧасти.Номенклатура,
    |	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
    |	NULL,
    |	ДанныеТабличнойЧасти.ЕдиницаИзмерения,
    |	ДанныеТабличнойЧасти.Коэффициент,
    |	ДанныеТабличнойЧасти.Количество,
    |	ДанныеТабличнойЧасти.Цена,
    |	ДанныеТабличнойЧасти.Сумма,
    |	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС),
    |	0,
    |	ДанныеТабличнойЧасти.Сумма - 0,
    |	ДанныеТабличнойЧасти.Сумма,
    |	ДанныеТабличнойЧасти.ЕдиницаИзмерения.Код
    |ИЗ
    |	Документ.ПоступлениеТоваровИУслуг.Услуги КАК ДанныеТабличнойЧасти
    |ГДЕ
    |	ДанныеТабличнойЧасти.Ссылка В(&МассивОбъектов)
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	ВТ_ДанныеТабличнойЧасти.ИмяТЧ КАК ИмяТЧ,
    |	ВТ_ДанныеТабличнойЧасти.Ссылка КАК Ссылка,
    |	ВТ_ДанныеТабличнойЧасти.НомерСтроки КАК НомерСтроки,
    |	ВТ_ДанныеТабличнойЧасти.Код КАК Код,
    |	ВТ_ДанныеТабличнойЧасти.Артикул КАК Артикул,
    |	ВТ_ДанныеТабличнойЧасти.Номенклатура КАК Номенклатура,
    |	ВТ_ДанныеТабличнойЧасти.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
    |	ВТ_ДанныеТабличнойЧасти.СерияНоменклатуры КАК СерияНоменклатуры,
    |	ВТ_ДанныеТабличнойЧасти.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
    |	ВТ_ДанныеТабличнойЧасти.Коэффициент КАК Коэффициент,
    |	ВТ_ДанныеТабличнойЧасти.Количество КАК Количество,
    |	ВТ_ДанныеТабличнойЧасти.Цена КАК Цена,
    |	ВТ_ДанныеТабличнойЧасти.Сумма КАК Сумма,
    |	ВТ_ДанныеТабличнойЧасти.СтавкаНДС КАК СтавкаНДС,
    |	ВТ_ДанныеТабличнойЧасти.СуммаНДС КАК СуммаНДС,
    |	ВТ_ДанныеТабличнойЧасти.СуммаБезНДС КАК СуммаБезНДС,
    |	ВТ_ДанныеТабличнойЧасти.СуммаСНДС КАК СуммаСНДС,
    |	ВТ_ДанныеТабличнойЧасти.ЕдиницаИзмеренияКод КАК ЕдиницаИзмеренияКод
    |ИЗ
    |	ВТ_ДанныеТабличнойЧасти КАК ВТ_ДанныеТабличнойЧасти
    |
    |УПОРЯДОЧИТЬ ПО
    |	ВТ_ДанныеТабличнойЧасти.Ссылка,
    |	ВТ_ДанныеТабличнойЧасти.ИмяТЧ,
    |	ВТ_ДанныеТабличнойЧасти.НомерСтроки
    |ИТОГИ ПО
    |	Ссылка";
    
	
	МассивРезультатов         = Запрос.ВыполнитьПакет();
	РезультатПоШапке          = МассивРезультатов[0];
	РезультатПоТабличнойЧасти = МассивРезультатов[2];
	
	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧасти",
	                                               РезультатПоШапке, РезультатПоТабличнойЧасти);
	
	Возврат СтруктураДанныхДляПечати;
    
КонецФункции

Процедура ДополнитьДанныеДляПечатныхФорм(РезультатЗапроса, ВыборкаПоТоварамУслугам = Неопределено) Экспорт
	
	ОбщийМодульСервер.ДобавитьКолонкиКонтактнойИнформации(РезультатЗапроса);
	
	РезультатЗапроса.Колонки.Добавить("ЕстьСерии", Новый ОписаниеТипов("Булево"));
	
	Для Каждого ТекущаяСтрока Из РезультатЗапроса Цикл
		
		ОбщийМодульСервер.ДополнитьДанныеДляПечатныхФормКонтактнойИнформацией(ТекущаяСтрока, ТекущаяСтрока.Организация, ТекущаяСтрока.Контрагент);
		
		СтруктураПоиска = Новый Структура("Ссылка", ТекущаяСтрока.Ссылка);		
		ВыборкаПоТоварамУслугам.Сбросить();
		Если ВыборкаПоТоварамУслугам.НайтиСледующий(СтруктураПоиска) Тогда			
			Выборка = ВыборкаПоТоварамУслугам.Выбрать();			
			Пока Выборка.Следующий() Цикл
				Если ЗначениеЗаполнено(Выборка.СерияНоменклатуры) Тогда
					ТекущаяСтрока.ЕстьСерии = Истина;
					Прервать;
				КонецЕсли; 		
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПечатьТОРГ12(МассивОбъектов, ОбъектыПечати)
	
	Возврат ОбщийМодульСервер.ПечатьТОРГ12(МассивОбъектов, ОбъектыПечати);
	
КонецФункции

Функция СформироватьПечатнуюФормуТоварнойНакладной(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; //#14053
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПоступлениеТоваровИУслуг_Накладная";
	//Макет = ПолучитьОбщийМакет("ТоварнаяНакладная");
	ВыводитьАртикул = Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить();
	
	СтруктураДанныхДляПечати = ПолучитьДанныеДляПечатныхФорм(МассивОбъектов);
	ТаблицаДанныеПечати = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();
	ВыборкаПоТоварамУслугам = СтруктураДанныхДляПечати.РезультатПоТабличнойЧасти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати, ВыборкаПоТоварамУслугам);
	
	ПервыйДокумент = Истина;
	Для Каждого ДанныеПечати Из ТаблицаДанныеПечати Цикл
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ЕстьСерии = ДанныеПечати.ЕстьСерии;
		
		Макет = ПолучитьОбщийМакет("ТоварнаяНакладная");
		
		ТекстЗаголовка = "Приходная накладная на товары №" + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.Номер) + " от " + Формат(ДанныеПечати.Дата, "ДЛф=Д");
	
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Организация");
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
	
		ОбластьМакета = Макет.ПолучитьОбласть("Склад");
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Изменения размера колоноки, в зависимости от вывода Артикула
		Если Не ВыводитьАртикул Тогда
			Попытка
				Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки = Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки + Макет.Область("Артикул").ШиринаКолонки;
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		ОбластьШапки = ?(ЕстьСерии, Макет.ПолучитьОбласть("ШапкаТаблицыССерией|НомерСтроки"), Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки")); 
		ОбластьШапки.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьШапки);
		
		Если ВыводитьАртикул Тогда
			ОбластьШапки = ?(ЕстьСерии, Макет.ПолучитьОбласть("ШапкаТаблицыССерией|Артикул"), Макет.ПолучитьОбласть("ШапкаТаблицы|Артикул"));
			ОбластьШапки.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьШапки);
		КонецЕсли;
		
		ОбластьШапки = ?(ЕстьСерии, Макет.ПолучитьОбласть("ШапкаТаблицыССерией|Данные"), Макет.ПолучитьОбласть("ШапкаТаблицы|Данные"));
		ОбластьШапки.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Присоединить(ОбластьШапки);
		
		Сумма = 0;
		
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);		
		ВыборкаПоТоварамУслугам.Сбросить();
		Если ВыборкаПоТоварамУслугам.НайтиСледующий(СтруктураПоиска) Тогда			
			Выборка = ВыборкаПоТоварамУслугам.Выбрать();			
			Пока Выборка.Следующий() Цикл			
				Если Выборка.ИмяТЧ = "Услуги" Тогда
					Продолжить;
				КонецЕсли;
				
				ОбластьСтроки = ?(ЕстьСерии, Макет.ПолучитьОбласть("СтрокаССерией|НомерСтроки"), Макет.ПолучитьОбласть("Строка|НомерСтроки"));
				ОбластьСтроки.Параметры.Заполнить(ДанныеПечати);
				ОбластьСтроки.Параметры.Заполнить(Выборка);
				ТабличныйДокумент.Вывести(ОбластьСтроки);
				
				Если ВыводитьАртикул Тогда
					ОбластьСтроки = ?(ЕстьСерии, Макет.ПолучитьОбласть("СтрокаССерией|Артикул"), Макет.ПолучитьОбласть("Строка|Артикул"));
					ОбластьСтроки.Параметры.Заполнить(ДанныеПечати);
					ОбластьСтроки.Параметры.Заполнить(Выборка);
					ТабличныйДокумент.Присоединить(ОбластьСтроки);
				КонецЕсли;	
				
				ОбластьСтроки = ?(ЕстьСерии, Макет.ПолучитьОбласть("СтрокаССерией|Данные"), Макет.ПолучитьОбласть("Строка|Данные"));
				ОбластьСтроки.Параметры.Заполнить(ДанныеПечати);
				ОбластьСтроки.Параметры.Заполнить(Выборка);
				
				//++ №12909
				//ПредставлениеНоменклатуры = Строка(Выборка.Номенклатура) + Строка(УправлениеПечатью.ПредставлениеХарактеристики(Выборка.ХарактеристикаНоменклатуры));
				ПредставлениеНоменклатуры = ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(Выборка.Номенклатура, Выборка.ХарактеристикаНоменклатуры);
				//-- №12909
				
				ОбластьСтроки.Параметры.Номенклатура = ПредставлениеНоменклатуры;
				ТабличныйДокумент.Присоединить(ОбластьСтроки);
				
				Сумма = Сумма + Выборка.Сумма;
				
			КонецЦикла;
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Итого|НомерСтроки");
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		Если ВыводитьАртикул Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("Итого|Артикул");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьМакета);
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Итого|Данные");
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		Попытка
			ОбластьМакета.Параметры.Сумма = Сумма;
		Исключение
		КонецПопытки;
		ТабличныйДокумент.Присоединить(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// В табличном документе необходимо задать имя области, в которую был 
        // выведен объект. Нужно для возможности печати комплектов документов.
        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
            НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
			
	КонецЦикла;
	
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#Область СозданиеНаОсновании

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	ИспользоватьЗаявкиНаРасходованиеДенежныхСредств = ПолучитьФункциональнуюОпцию("ИспользоватьЗаявкиНаРасходованиеДенежныхСредств");
	
	Документы.ВозвратТовараПоставщику.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Если ИспользоватьЗаявкиНаРасходованиеДенежныхСредств Тогда
		Документы.ЗаявкаНаРасходованиеДенежныхСредств.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	КонецЕсли;
	
	Документы.ПеремещениеТоваров.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.ПлатежноеПоручениеИсходящее.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Если Не ИспользоватьЗаявкиНаРасходованиеДенежныхСредств Тогда
		Документы.РасходныйКассовыйОрдер.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	КонецЕсли;
	
	Документы.РеализацияТоваровИУслуг.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Если Не ИспользоватьЗаявкиНаРасходованиеДенежныхСредств Тогда
		Документы.СписаниеСРасчетногоСчета.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	КонецЕсли;
	
	//#14205
	Документы.СписаниеТоваров.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.УстановкаЦенМатериаловПоставщиков.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.УстановкаЦенМатериалов.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.УстановкаЦенНоменклатуры.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.УстановкаЦенПоставщика.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры

// Добавляет команду создания документа "Поступление товаров и услуг"
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании, ФункциональныеОпции="") Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.ПоступлениеТоваровИУслуг) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.ПоступлениеТоваровИУслуг.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = Метаданные.Документы.ПоступлениеТоваровИУслуг.Представление();
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.ФункциональныеОпции = ФункциональныеОпции;

		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

// Добавляет команду создания документа "Поступление товаров и услуг" для заказа на производство.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОснованииЗаказаНаПроизводство(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.ПоступлениеТоваровИУслуг) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик = "СозданиеНаОснованииПотолкиКлиент.ПоступлениеТоваровИУслугСоздатьНаОснованииЗаказаНаПроизводство";
		КомандаСоздатьНаОсновании.Представление = Метаданные.Документы.ПоступлениеТоваровИУслуг.Представление();
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#КонецЕсли

// №12269
Процедура ПроверитьКоличествоИПлощадьПотолка(ДокументОбъект, Отказ, РежимЗаписи) Экспорт
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Для Каждого ТекущаяСтрока Из ДокументОбъект.Товары Цикл
			
			Если ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура.Потолок_КоличествоПродукция)
				И Не ТекущаяСтрока.Номенклатура.Потолок_КоличествоПродукция = (ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент) Тогда
				
				Сообщить("В строке " + ТекущаяСтрока.НомерСтроки + ", по позиции """ + ТекущаяСтрока.Номенклатура + """ различается количество с площадью потолка, указанного в карточке номенклатуры.");
				Отказ = Истина;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

//nva+++
Функция ПолучитьМассивРеквизитовПоЦенам() Экспорт
	
	МассивИменЭлементов = Новый Массив;
	
	МассивИменЭлементов.Добавить("ТоварыЦена");
	МассивИменЭлементов.Добавить("ТоварыСумма");
	МассивИменЭлементов.Добавить("ТоварыСуммаНДС");

	Возврат МассивИменЭлементов;
	
КонецФункции
//nva---
